1
#Задание 1
list.append([1,2,3,]) добавление элемента
list.index(5) поиск по индексу
list.sort(numbers) сортировка
list.upper(х) верхний регистр
list.insert(i,x) добавление переменной по индексу
list.pop () удаление элемента

строк (str)
S.upper(),S.lower() верхний.нижний регистр
S[i:j:step] срез
len(S) длина
S1 + S2 конкатенация
S = "s\np\ta\nbbb"-экранинрование

множества (set)
len(s) - число элементов в множестве (размер множества).
x in s - принадлежит ли x множеству s.
set.copy() - копия множеств
set.add(elem) - добавляет элемент в множество.
set.remove(elem) - удаляет элемент из множества

словари (dict)

dict.clear() - очищает словарь.
dict.pop(key[, default]) - удаляет ключ и возвращает значение
dict.copy() - возвращает копию словаря.
dict.fromkeys(seq[, value]) - создает словарь с ключами из seq и значением value
dict.values() - возвращает значения в словаре